app/controllers/admin/collections_groups_controller.rb

  def index
    @collections_groups = CollectionsGroup.order(:full_name).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `collections_groups` LIMIT 20 OFFSET 0) subquery_for_count
SELECT `collections_groups`.* FROM `collections_groups` ORDER BY full_name asc LIMIT 20 OFFSET 0