app/controllers/admin/collection_types_controller.rb

  def index
    @objects = CollectionType.order(CollectionType.sort_column).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `collection_types` LIMIT 20 OFFSET 0) subquery_for_count
SELECT `collection_types`.* FROM `collection_types` ORDER BY full_name asc LIMIT 20 OFFSET 0