app/controllers/admin/collections_controller.rb

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 102 LIMIT 1
---
	def find_collection
		@collection = Collection.find(params[:id])

SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `collections` LIMIT 25 OFFSET 0) subquery_for_count
SELECT `collections`.* FROM `collections` ORDER BY full_name desc LIMIT 20 OFFSET 0
---
  def index
		sort_column ||= 'full_name'
    @collections = Collection.order(sort_column + " " + sort_direction).page(params[:page])

INSERT INTO `collections` (`connection_type`, `created_at`, `definition`, `full_name`, `harvest_end`, `harvest_start`, `host`, `name`, `password`, `record_schema`, `success`, `updated_at`, `url`, `user`, `word`) VALUES (NULL, '2013-03-11 22:58:17', NULL, 'Catalogue BPI', NULL, NULL, '10.1.2.100', 'portfoliodw', 'postgrsbpi', NULL, 1, '2013-03-11 22:58:17', NULL, 'postgresbpi', NULL)
---
  def create
    @collection = Collection.new(params[:collection])
		if @collection.save

UPDATE `collections` SET `host` = 'http://americanfilms.com', `password` = 'qsdfqsf', `updated_at` = '2013-03-15 15:25:07' WHERE `collections`.`id` = 54
---
  def update
		if @collection.update_attributes(params[:collection])

DELETE FROM `collections` WHERE `collections`.`id` = 102
---
  def destroy
		name = @collection.full_name
    @collection.destroy