app/controllers/admin/harvest_logs_controller.rb

  def index
		sort_column ||= 'start'
		sort_direction ||= 'desc'
		@collection = Collection.find(params[:collection_id])
   	@harvest_logs = @collection.harvest_logs.order(sort_column + " " + sort_direction).page(params[:page])
---
SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 55 LIMIT 1
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 54 LIMIT 20 OFFSET 0) subquery_for_count
SELECT `harvest_logs`.* FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 54 ORDER BY start desc LIMIT 20 OFFSET 0

  def destroy
    @harvest_log = HarvestLog.find(params[:id])
		date = @harvest_log.start.strftime('%d/%m/%Y')
		@collection = @harvest_log.collection
    @harvest_log.destroy
---
SELECT `harvest_logs`.* FROM `harvest_logs` WHERE `harvest_logs`.`id` = 0 LIMIT 1
DELETE FROM `harvest_logs` WHERE `harvest_logs`.`id` = 4

	def destroy_all
		collection = Collection.find(params[:collection_id])
---
SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 55 LIMIT 1