app/controllers/admin/parameters_controller.rb

SELECT `parameters`.* FROM `parameters` WHERE `parameters`.`id` = 11 LIMIT 1
---
	def find_parameter
    @parameter = Parameter.find(params[:id])

SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `parameters` LIMIT 20 OFFSET 0) subquery_for_count
SELECT `parameters`.* FROM `parameters` ORDER BY name asc LIMIT 20 OFFSET 0
---
  def index
		sort_column ||= 'name'
    @parameters = Parameter.order(sort_column + " " + sort_direction).page(params[:page])

INSERT INTO `parameters` (`created_at`, `name`, `updated_at`, `value`) VALUES ('2013-03-14 11:21:03', 'theme_separator', '2013-03-14 11:21:03', '>')
---
  def create
    @parameter = Parameter.new(params[:parameter])
		if @parameter.save

UPDATE `parameters` SET `description` = '', `value` = '20', `updated_at` = '2013-03-18 09:43:47' WHERE `parameters`.`id` = 11
---
  def update
		if @parameter.update_attributes(params[:parameter])