app/views/admin/harvest_logs/index.html.haml

SELECT `harvest_logs`.* FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 55 ORDER BY start desc LIMIT 1
---
	%form.form-search
		= text_field_tag :q, nil, :placeholder => t('harvest_log.search').html_safe, :class => 'searchbar pull-left', 'data-provide' => 'typeahead', :klass => "/harvest_logs", :nested => @collection.id