app/views/admin/parameters/index.html.haml

SELECT `parameters`.* FROM `parameters`
---
		%form.form-search
			= text_field_tag :q, nil, :placeholder => t('parameter.search').html_safe, :class => 'searchbar pull-left', 'data-provide' => 'typeahead', :klass => "parameters"