app/views/admin/collections/_listing.html.haml

					%td= collection.host.truncate(30, :omission => '...').html_safe
					- if collection.harvest_logs.empty?
---
SELECT COUNT(*) FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 106
SELECT `harvest_logs`.* FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 106 ORDER BY start desc LIMIT 1