app/views/admin/collections/index.html.haml

SELECT `collections`.* FROM `collections`
---
		%form.form-search
			= text_field_tag :q, nil, :placeholder => t('collection.search').html_safe, :class => 'searchbar pull-left', 'data-provide' => 'typeahead', :klass => "/collections"