app/views/admin/collections/show.html.haml

SELECT COUNT(*) FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 101
SELECT `harvest_logs`.* FROM `harvest_logs` WHERE `harvest_logs`.`collection_id` = 101 ORDER BY start desc LIMIT 1
---
	%dt= t('collection.last_harvest').html_safe
	- if @collection.harvest_logs.empty?